// miniprogram/pages/notice/notice.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    noticeContent: ["每人最多可报2个部门，每次面试将优先录取大一", "每人最多可被2个部门录取，雁祉作坊和one echo不会同时录取", "第二志愿将等到第一志愿出结果后决定是否录取", "媒体部小程序组需参加one echo入部考核与入部后培训", "若接受调剂，第一、二志愿落选后有可能被调剂到其它部门", "如无特殊情况，雁祉作坊和one echo不参与春招", "各部门安排的考核场次将会发布在查询报名状态中，请查询后选择自己可参加的场次", "考核场次发布时将会在招新群中通知，如有特殊情况可联系部长调整", "考核、录取等结果将会第一时间更新在查询报名状态中", "最终无论录取与否，都会以QQ或短信形式通知", "本期招新结束后，将清除报名数据，下期招新可重复报名", "如有部门相关技术基础，可联系部长免试内推"]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})